app/views/books/show.jbuilder

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  json.extract! leaf, :id, :position_score, :title, :created_at, :updated_at
  if leaf.page?
    json.content sanitize_content(leaf.page.html_preview)