app/controllers/books_controller.rb

  def update
    @book.update(book_params)
---
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "The Writebook Manual new version"], ["updated_at", "2024-11-21 05:47:18.154552"], ["id", 1]]

    def set_users
      @users = User.active.ordered
---
SELECT "users"."id" FROM "users" WHERE "users"."active" = ?  [["active", 1]]

    def ensure_index_is_not_empty
      if !signed_in? && Book.published.none?
---
SELECT 1 AS one FROM "books" WHERE "books"."published" = ? LIMIT ?  [["published", 1], ["LIMIT", 1]]